# We Gonna Make It!

In [2]:
# 라이블러리 불러오기
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
# 데이터 읽어오기
path = 'https://bit.ly/AirQFile'
air = pd.read_csv(path)

# 확인
air.head()

   Ozone  Solar.R  Wind  Temp  Month  Day
0   41.0    190.0   7.4    67      5    1
1   36.0    118.0   8.0    72      5    2
2   12.0    149.0  12.6    74      5    3
3   18.0    313.0  11.5    62      5    4
4    NaN      NaN  14.3    56      5    5

In [4]:
# 결측치
air.isna().sum()

Ozone      37
Solar.R     7
Wind        0
Temp        0
Month       0
Day         0
dtype: int64

In [5]:
# 결측치 채우기 - 시계열자료로 볼 수 있으니 앞에 있는 값으로 채우자!
air.fillna(method='ffill', inplace = True)

# 확인
air.isna().sum()

Ozone      0
Solar.R    0
Wind       0
Temp       0
Month      0
Day        0
dtype: int64

In [6]:
# 기초통계정보
air.describe()

            Ozone     Solar.R        Wind        Temp       Month         Day
count  153.000000  153.000000  153.000000  153.000000  153.000000  153.000000
mean    39.784314  186.032680    9.957516   77.882353    6.993464   15.803922
std     31.559455   90.698707    3.523001    9.465270    1.416522    8.864520
min      1.000000    7.000000    1.700000   56.000000    5.000000    1.000000
25%     16.000000  112.000000    7.400000   72.000000    6.000000    8.000000
50%     30.000000  203.000000    9.700000   79.000000    7.000000   16.000000
75%     52.000000  259.000000   11.500000   85.000000    8.000000   23.000000
max    168.000000  334.000000   20.700000   97.000000    9.000000   31.000000

In [28]:
# x, y 분리
target = 'Ozone'
x = air.drop(target, axis=1)
y = air[target]

In [29]:
# 학습용, 평가용 데이터 7:3 나누기
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3,
                                                   random_state=2022)
# 확인
print(x_train.shape,  x_test.shape, y_train.shape, y_test.shape)

(107, 5) (46, 5) (107,) (46,)

-----------------------------------------------------------------------

In [12]:
# Graduate - 대학원 입학시험
path = 'https://bit.ly/GraduateFile'
graduate = pd.read_csv(path)

# 확인
graduate.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

→ 합격했니? 불합격했니? - 분류할 때 쓰는 데이터 프레임

→ rank는 분류해서 보는 것이 의미있기 때문에 가변수화 해야한다!

In [13]:
# 범주값 확인
graduate['rank'].value_counts()

2    151
3    121
4     67
1     61
Name: rank, dtype: int64

In [14]:
# 가변수화
graduate = pd.get_dummies(graduate, columns=['rank'], drop_first=True) # 다중공선성 문제를 없애기 위해 drop_

# 확인
graduate.head()

   admit  gre   gpa  rank_2  rank_3  rank_4
0      0  380  3.61       0       1       0
1      1  660  3.67       0       1       0
2      1  800  4.00       0       0       0
3      1  640  3.19       0       0       1
4      0  520  2.93       0       0       1

In [ ]:
# graduate.loc[ 행, 열] == graduate[열]

In [15]:
# x, y 분리
target = 'admit'
x = graduate.drop(target, axis=1)
y = graduate.loc[:, target]

In [16]:
# 확인
print(x.shape)
print(y.shape) # ← 데이터프레임에서 컬럼 하나를 가져왔기 때문에 시리즈!

(400, 5)
(400,)

> (400,) 의미는 시리즈라는 뜻!

In [26]:
# 학습용, 평가용 데이터 나누기(7:3) == (x, y)
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3,
                                                   random_state=2022)

> x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3,
                                                   shuffle=False)
shuffle=False : 원래 랜덤으로 값이 나오는데, 이걸 쓰면 결과가 똑같이 나옴

> x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3,
                                                   random_state=2022)
random_state=2022 : sampling을 똑같이 해주는거, 시드값을 주는거, 보통 책에서 따라하면 저자랑 똑같은 결과가 보이게 지정해주는 거지!

In [27]:
x_train.head()

     gre   gpa  rank_2  rank_3  rank_4
387  580  3.36       1       0       0
169  600  3.62       0       1       0
382  540  3.51       1       0       0
280  660  3.94       1       0       0
140  640  3.93       1       0       0